GL plan ran against anvildev:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.gitlab_cpu_use must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "gitlab_cpu_use" {
      ~ alarm_name                            = "azul-gitlab_cpu_use" -> "azul-gitlab-anvildev_cpu_use" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:289950828509:alarm:azul-gitlab_cpu_use" -> (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "azul-gitlab_cpu_use" -> (known after apply)
        tags                                  = {
            "Name"                = "azul-gitlab_cpu_use"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_cpu_use"
            "deployment"          = "anvildev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_data_disk_use must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "gitlab_data_disk_use" {
      ~ alarm_name                            = "azul-gitlab_data_disk_use" -> "azul-gitlab-anvildev_data_disk_use" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:289950828509:alarm:azul-gitlab_data_disk_use" -> (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "azul-gitlab_data_disk_use" -> (known after apply)
        tags                                  = {
            "Name"                = "azul-gitlab_data_disk_use"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_data_disk_use"
            "deployment"          = "anvildev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_root_disk_use must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "gitlab_root_disk_use" {
      ~ alarm_name                            = "azul-gitlab_root_disk_use" -> "azul-gitlab-anvildev_root_disk_use" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:289950828509:alarm:azul-gitlab_root_disk_use" -> (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "azul-gitlab_root_disk_use" -> (known after apply)
        tags                                  = {
            "Name"                = "azul-gitlab_root_disk_use"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_root_disk_use"
            "deployment"          = "anvildev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (19 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.

```